app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date
---
    def index
      @all_ratings = Movie.ratings
      params[:ratings].nil? ? rparam = @all_ratings : rparam = params[:ratings].keys
      @movies = Movie.where(rating: rparam).all.order(params[:sort])